namespace Soccer.Domain.Interfaces
{
    /* Головна причина розміщення інтерфейсів репозиторіїв у шарі Domain -
     * це Принцип інверсії залежностей (Dependency Inversion Principle, DIP).

Визначення інтерфейсів на рівні домену вирішує три ключові завдання:

1. Домен володіє своїми вимогами (Domain Ownership)
    Доменна логіка - це найцінніше ядро застосунку.
    Домен не повинен залежати від зовнішнього середовища (баз даних, ORM, фреймворків).

    Коли домену потрібно зберегти або завантажити сутність (наприклад, Team або Player),
    саме домен диктує контракт: "Мені абсолютно байдуже, де і як ви зберігаєте дані (у PostgreSQL, MongoDB чи в пам'яті),
    але мені потрібен механізм, який вміє виконувати ось ці дії".

2. Розворот напрямку залежностей
   У Clean Architecture та Domain-Driven Design (DDD) усі залежності спрямовані
    суворо всередину — до Домену.

                   ┌──────────────────┐
                   │   Presentation   │
                   └───────┬──░───────┘
                           │  ░
             ┌─────────────┘  ░ (тільки для DI)
             │                ░
             ▼                ▼
    ┌──────────────────┐  ┌──────────────────┐
    │   Application    │  │  Infrastructure  │
    └────────┬─────────┘  └─────────┬────────┘
             │                      │
             └───────────┬──────────┘
                         │
                         ▼
            ┌────────────────────────┐
            │         Domain         │  (Центр)
            └────────────────────────┘

   Domain нічого не знає про EF Core, DbContext або SQL.
    Він знає лише про абстрактний IRepository<T>.

   Infrastructure посилається на Domain і реалізує інтерфейс IRepository<T>
    через конкретний інструмент (EF Core, Dapper, Redis тощо).

3. Легкість тестування (Unit Testing)
Коли інтерфейси оголошені всередині Domain, доменну логіку та Use Cases
    можна тестувати ізольовано без реальної бази даних.
     */

    public interface IRepository<T> where T : class
    {
        Task<IEnumerable<T>> GetAll();
        Task<T?> Get(int id);
        Task<T?> Get(string name);
        Task Create(T item);
        void Update(T item);
        Task Delete(int id);
    }
}